# ____________________________________Первый вариант решения:____________________________________
seasons = ['зима', 'весна', 'лето', 'осень']
while True:
    n = int(input('Введите номер месяца: '))
    if n == 12 or n <= 2 and n > 0:
        print(f'Это {seasons[0]}')
        break
    elif n > 2 and n <= 5:
        print(f'Это {seasons[1]}')
        break
    elif n > 5 and n <= 8:
        print(f'Это {seasons[2]}')
        break
    elif n > 8 and n <= 11:
        print(f'Это {seasons[3]}')
        break
    else:
        print('Вы ввели неверный номер месяца, номер должен быть от 1 до 12')

# ____________________________________Второй вариант решения____________________________________
seasons = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
n = 0
while n <= 0 or n >= 12:
    n = int(input('Введите номер месяца: '))
    print(f'Это {seasons[n - 1]}') if (n > 0 and n <= 12) else print(
        'Вы ввели неверный номер месяца, номер должен быть от 1 до 12')
